# CannotLinkAnnotationsForSomeViews Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..CannotLinkAnnotationsForSomeViews Property
BuiltInFailures..::..GroupFailures Class See Also
---
Annotations for some views cannot be displayed from linked file.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotLinkAnnotationsForSomeViews { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotLinkAnnotationsForSomeViews As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotLinkAnnotationsForSomeViews {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace